app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "asd"], ["body", "asd"], ["user_id", 2], ["created_at", "2020-01-21 16:21:48.896547"], ["updated_at", "2020-01-21 16:21:48.896547"]]
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "asds"], ["updated_at", "2020-01-21 16:47:30.309267"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)